In [2]:
import pandas as pd
import mysql.connector

In [2]:
!pip install mysql-connector-python

DEPRECATION: Loading egg at /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages/jupyter-1.0.0-py3.12.egg is deprecated. pip 25.1 will enforce this behaviour change. A possible replacement is to use pip for package installation. Discussion can be found at https://github.com/pypa/pip/issues/12330
Collecting mysql-connector-python
  Downloading mysql_connector_python-9.5.0-cp312-cp312-macosx_14_0_arm64.whl.metadata (7.5 kB)
Downloading mysql_connector_python-9.5.0-cp312-cp312-macosx_14_0_arm64.whl (17.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 17.6/17.6 MB 3.1 MB/s eta 0:00:00[31m3.0 MB/s eta 0:00:01
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.5.0

[notice] A new release of pip is available: 25.0.1 -> 25.3
[notice] To update, run: pip install --upgrade pip

In [3]:
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="rootroot",
    database="revenue_leak_db"
)

In [6]:
query = "SELECT * FROM sales;"

In [7]:
df = pd.read_sql(query, conn)

/var/folders/gf/7hhj2tnx4dl2kbv8qxx540n40000gn/T/ipykernel_1391/1099238964.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

In [8]:
conn.is_connected()

True

In [9]:
cursor = conn.cursor()
cursor.execute("SELECT * FROM sales;")
rows = cursor.fetchall()
rows

[(101,
  datetime.date(2024, 1, 10),
  'Running shoes',
  'Footwear',
  2,
  Decimal('3000.00'),
  Decimal('10.00'),
  0,
  'North')]

In [11]:
columns = [
    "order_id",
    "order_date",
    "product_name",
    "category",
    "quantity",
    "price",
    "discount",
    "return_flag",
    "region"

]

In [12]:
df = pd.DataFrame(rows, columns=columns)
df

,order_id,order_date,product_name,category,quantity,price,discount,return_flag,region
0,101,2024-01-10,Running shoes,Footwear,2,3000.00,10.00,0,North

In [13]:
df["net_revenue"] = df["quantity"] * df["price"] * (1 - df["discount"] / 100)
df

,order_id,order_date,product_name,category,quantity,price,discount,return_flag,region,net_revenue
0,101,2024-01-10,Running shoes,Footwear,2,3000.00,10.00,0,North,5400.0000

In [14]:
leaks = df[df["return_flag"] == 1]
leaks

Empty DataFrame
Columns: [order_id, order_date, product_name, category, quantity, price, discount, return_flag, region, net_revenue]
Index: []

In [15]:
df[["net_revenue"]].sum()

net_revenue    5400.0000
dtype: object

In [18]:
cursor.execute("SELECT * FROM sales;")
rows = cursor.fetchall()

df = pd.DataFrame(rows,columns=columns)
df["net_revenue"] = df["quantity"] * df["price"] * (1 - df["discount"] / 100)
df

,order_id,order_date,product_name,category,quantity,price,discount,return_flag,region,net_revenue
0,101,2024-01-10,Running shoes,Footwear,2,3000.00,10.00,0,North,5400.0000

In [ ]:
cursor.execute("SELECT * FROM sales;")
rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=columns)
df["net_revenue"] = df["quantity"] * df["price"] * (1 - df["discount"] / 100)
df